{
    "pages": [
        {
            "title": "Nada é por acaso", 
            "text":"Esse último final de semana estava conversando com a recepcionista da escola de inglês que eu estudo, chegamos no assunto onde ela contava alguns cursos que ela já tinha feito e que estava fazendo. Como um curso de Petróleo e Gás, que ela fez aos 14 anos, e tempo depois um curso de Gestão e Logística em Petróleo e Gás, por fim, estava fazendo o curso de Pedagogia. Uma de suas reclamações era que seus cursos, principalmente o primeiro de Petróleo e Gás, não ajudava em nada no seu emprego atual, nem mesmo o inglês aprendido nesse curso, coisa que nesse emprego era necessário, já que era uma escola de inglês, e que no final de contas ela achava que o investimento naquele curso foi uma perda de tempo. Apenas o segundo curso tinha algum tipo de serventia já que ela utiliza alguns daqueles conceitos ligados a gestão. Particularmente me senti incomodado com o que ela contou, ainda tentei argumentar que os conhecimentos obtidos na vida são complementares, mas acho que não foi muito efetivo, tendo em vista a reação negativa que ela teve. Isso me fez pensar exatamente um pouco no que eu já vivi, mesmo não sendo muito ( :D ), bom, antes de fazer o curso de Sistemas de Informação cheguei a fazer um curso no Senai na área da elétrica industrial, logo em seguida entrei em um curso técnico em Eletrotécnica. Nesse mesmo período comecei a trabalhar em uma empresa na área, e já em poucos tempo, tive uma mudanças de cargo para melhor. Com alguns meses de emprego, e o primeiro módulo do curso técnico finalizado, minha vida teve uma reviravolta quando tive a noticia que tinha passado no IFES, ainda lembro desse dia como se fosse hoje. E com todo apoio da minha família larguei tudo para iniciar uma jornada no curso superior. Naquele momento podia imaginar que toda esse investimento de tempo, esforço e dinheiro iria por água a baixo, mas meu único foco era aproveitar o curso ao máximo. Hoje antes mesmo de me graduar, já estou contratado como profissional da área. E o mais interessante, estou trabalhando em projetos ligados principalmente a elétrica industrial, pois é, todo aquele conhecimento que eu tive antes mesmo de entrar na faculdade, estão sendo fundamentais para que eu consiga entender e desenvolver o que é proposto. E se algum dia me der na telha e largar tudo para vender miçangas na praia, será que todo o investimento que fiz anos atrás não me trouxe retorno nenhum, mesmo que seja em recurso ou network? Sinceramente acho muito difícil. Pra fechar, gostaria de dizer que toda fase que estivermos vivendo deve ser aproveitada ao máximo, mesmo em momentos ruins, podemos tirar proveito de alguma coisa, seja com novos amigos, aprendizado ou novas oportunidades, que também podem aparecer apenas anos depois. Pense nisso.", 
            "tags": "Know-how", 
            "loc": "http://marcosdias.github.io/blog/nada-e-por-acaso.html"
        },
        {
            "title": "Introdução ao Git", 
            "text":"Fala pessoal, dias atrás eu dei um treinamento na empresa em que eu trabalho, sobre Git. Aproveitando a oportunidade vou publicar os slides aqui: Introdução ao git from Marcos Dias Se você encontrou algum erro, me dê um toque. :)", 
            "tags": "Git", 
            "loc": "http://marcosdias.github.io/blog/introducao-ao-git.html"
        },
        {
            "title": "Reboot no Blog", 
            "text":"Fala galera, tem tempo que não escrevo nada no meu blog e recentemente recebi um email do Diego Eis do Tableless sobre o valor de ensinar o próximo, e como isso é vantajoso para nós mesmos, bom, essa vontade de escrever voltou e vou me esforçando para que eu consiga isso. Para que essa mesma vontade chegue a todos segue o texto que eu li: Um francês chamado Joseph Joubert tem uma frase bem interessante: “To teach is to learn twice”. A partir do momento que eu ensinei alguém como a simples propriedade float do CSS funcionava, eu absorvi tanta informação que eu fiquei espantado. Como algo tão simples pode me ajudar tanto? Quando você ensina, você desbloqueia uma série de gatinhos como didática, oratória e principalmente detalhamento dos assuntos… Para ensinar você precisa saber de detalhes que a maioria das pessoas nem imagina em pesquisar. E é aí que você ganha. Tente fazer um favor para você mesmo: ensine alguém. Escreva um artigo rico e detalhado, ajude um novato na área, faça slides mesmo que você não seja palestrante. Esse é o primeiro passo para uma viagem sem volta. É isso ai, que venham os próximos conteúdos. :)", 
            "tags": "Blog", 
            "loc": "http://marcosdias.github.io/blog/reboot-blog.html"
        }        
    ]
}